[
  {
    "title": "Bangalore, what's a cafe/restaurant you randomly discovered in the city and loved it?",
    "text": "Mine was Champaca. Was at Cunningham road with a friend and saw the location of another friend's IG story. It looked so pretty and turned out I was literally a km away. It's a quaint little book cafe and it's one my favourites till date!",
    "url": "https://reddit.com/r/bangalore/comments/px0yfm/bangalore_whats_a_caferestaurant_you_randomly/",
    "subreddit": "bangalore"
  },
  {
    "title": "WFH in Bangalore: WiFi stable, but my mental health isn’t.",
    "text": "Moved here dreaming of cafe coding.\n\nNow I’m working from bed, with my laptop as a hot water bag.\n\nPower cuts, noisy neighbors, Zoom fatigue.\nTried a co-working space paid ₹9k to hear 10 strangers pitch to VCs.\n\nEvery day I write code, forget it by evening, and stare into the void during standup.\n\nTech life? More like slow wifi & existential dread.\n",
    "url": "https://reddit.com/r/bangalore/comments/1ltts5h/wfh_in_bangalore_wifi_stable_but_my_mental_health/",
    "subreddit": "bangalore"
  },
  {
    "title": "What's an eatery / cafe/ bar you loved in Bangalore for many years & sad that it's not around any more or recently shut? and is there some places you are thankful for still existing?",
    "text": "For me:\n\nEgg Factory - Especially the St.Marks Road one, why the hell did they shut? I always thought they were doing so well :(\n\nGloria Jean's Coffee Indirangar - One of the few chilled out nice cafes Indiranagar had :/\n\nTavern at the Inn, Museum Road - Never had a chance to visit, and it shut :(\n\nGlad that these places still exist:\n\nScottish Pub / Noon Wines",
    "url": "https://reddit.com/r/bangalore/comments/xc0fv3/whats_an_eatery_cafe_bar_you_loved_in_bangalore/",
    "subreddit": "bangalore"
  },
  {
    "title": "what does it take to own and operate a coffee shop/cafe in bangalore?",
    "text": "say in a high traffic area like Jayanagar, JP nagar or Banashankari 2nd Stage. If anyone here has done it and can provide a very rough estimate for set-up and running costs, that'd be really helpful.",
    "url": "https://reddit.com/r/bangalore/comments/1d4xwhw/what_does_it_take_to_own_and_operate_a_coffee/",
    "subreddit": "bangalore"
  },
  {
    "title": "Any cafe/restaurant in Bangalore where I can just sit the entire day with my laptop and work?",
    "text": "So I've got a couple of hectic weeks ahead of me and I can't sit at home and work( too much going on at home and I keep getting distracted by parents and privacy invaded). Me and a friend of mine need to meet up and finish up our project. Basically need a cafe/restaurant where I can just plug in and sit, I have no problem ordering food or coffee if that place demands it. Just that I need to be there the entire day without being judged by anyone or asked to leave 😅. It could even be a good library, if something like that exists.",
    "url": "https://reddit.com/r/bangalore/comments/157ot94/any_caferestaurant_in_bangalore_where_i_can_just/",
    "subreddit": "bangalore"
  },
  {
    "title": "Has anyone taken a part time job at a cafe or a restaurant in bangalore ?",
    "text": "I am a b tech student, in my final year. I don't have money troubles and I know I can get a paid job in my field but I've always wanted to know how it's like to work in a cafe / restaurant.  Now that I have no classes and my internship doesn't start until January,  I really wanted to try this out. \n\nIs it a very wierd thought? Or has anyone else done this before? \nWhere and how was your experience? And more importantly,  how to go about getting a part time job at a cafe?",
    "url": "https://reddit.com/r/bangalore/comments/qfqi14/has_anyone_taken_a_part_time_job_at_a_cafe_or_a/",
    "subreddit": "bangalore"
  },
  {
    "title": "Dear Bangalore, I am leaving you...",
    "text": "Dear Bangalore,   \nI am leaving you. You were one of the first cities that I fell in love with. Back in 2010, when I was in 5th, I came to visit my cousins in this city. It wasn't my first time, but at that point of time I started really observing. The black tarmac roads flanked by huge trees, the city smell, the light cold breeze brushed through my hair as I sat in my cousins car. I knew, this was the city that I first wanted to visit when I grow up. Like how some people fantasize about New York city, that was Bangalore to me - a city full of hope, love, excitement and chaos.   \nI remember this was the same city that I fell in love with my best-friend during one of our school trips. Even though I knew I had feeling for her, it was at that night on some highway in Bangalore that we locked eyes in the bus. We kept on staring into each others eyes with love and I knew she was the one. We carried on with our relationship for a long time, both as best friends and lovers. But she had to move to Bangalore for work. I was working remote in my hometown, so we had a plan that one day I was also gonna move to Bangalore when I make money that can help me survive in a city.   \n\n\n2 Years passed and we were doing long distance, we used to meet often in this city, roam around in her scooter, visit cute cafes and things this city can offer. But if you've ever been in a Long Distance Relationship, you know there are problems. The constant missing each other, video calls, getting emotional with each other, fights, and then making up etc. But we reached a point where we knew we had to be together to take this relationship forward. We decided I will shift to Bangalore the next month after receiving my hike.   \nWe started having misunderstandings during that month and she even told me she fell out of love. I mustered up my courage and decided that I need to make this right and bring back the old us. As soon as I received my hike, I ordered a racksack, put some clothes inside it and freaking took a train to Bangalore. That inner child in me, who always wanted to live in this city super excited, and I was the most happiest person on earth. I had planned a lot of things for us, lots of exciting stuff this city has to offer.   \n\n\nLong story short, she broke up with me the 2nd day itself of me coming to Bangalore. She started getting fussed over small things and I just took it all inside and kept silent. It was one of the first time that I was seeing her like this. She said she had no feelings for me, but I was still in love with her and I stood by her side, thinking I could make her fall in love with me. We hanged out as \"friends\" for a while and then after 1 week, she revealed something. She said she cheated on me with her male roommate while we were in a relationship. And that broke my heart into pieces. Yes, the person that I loved the most in the world cheated on me. I didn't say a word. I just left her place. I walked through the busy roads like a guy who just lost a person whom I've known for the past 10 years just died. Luckily, I had a close friend whom I have know for years in Bangalore. DG if you're seeing this, you were the one of the people who was there for me during the lowest point of my life. Thank you for being there for me.\n\nI didn't give up. I didn't run away, instead I stayed in this exact city. This city was where I wanted to be despite breaking my heart.  I went no-contact with her.  I stayed in a PG, exploring the city all by myself.I started going to meetups, hopped and worked out of cafe's, bookclubs, went treking, had pizza parties and more things to keep myself busy and forget the pain. This city gave me hope that, life goes on, its okay to get hurt, its okay to miss that person but never ever change who you are as a person and to always keep your principles. Life goes on.  \n\n\nBut after a few months, I realized I was missing something. The closeness of family. She was one of the closest person that was in my life who knew everything about me, even things my family didn't know and I would get depressed thinking she is so close to me, someone who has know me for years, but is now a total stranger. I needed a change of location and I needed to be with my family. I will be going tonight back to my hometown. I am not going back forever. I will come back to this city, fully healed, as an even better version of myself and I will find a job here and live here without all the trauma that I have right now, and I have to thank this place for giving me this experience. I learned things within a few months that I could have taken 2 or 3 years to learn. This city took me to the middle of the ocean, told me to jump out of the ship and shouted \"Stay afloat no matter what\"  \n\n\nThank you for reading my sad sobbing story. I didn't mean for it to be this long, but I am very emotional. I will miss this place filled with love and beautiful people. I will miss you Bangalore. But I will come back stronger, just wait. Until then.   \n\n\nWith love,   \nStranger who loves you.",
    "url": "https://reddit.com/r/bangalore/comments/141c4om/dear_bangalore_i_am_leaving_you/",
    "subreddit": "bangalore"
  },
  {
    "title": "For everyone who are organizing or visiting reddit meetups. Read this whole post",
    "text": "Not sure if i picked the right flair for this\n\nI have been organizing some meetups of small groups for a while now in both mumbai and bangalore, although this is a very fun activity to do, I am sharing one of the experience which made me and others like me who organised meetups come up with precautions which I believe would be helpful for everyone who are organising or visiting meetups.\n\nThis was when we were fairly new to organising meetups. We were a group of 15 people and we closed meetup group after the 15 people as this was fairly new to us and we did not wanted to host a very big event.\n\nAlthough the experience was good, we started by strolling mg road and then having a quick bite at easybites and then went to the entertainment store in mg road.\n\nI am not gonna go into every little detail of the day, but to sum it up—by evening, we headed to Pegs n Bottles for drinks. As the night wound down and we were getting ready to settle the bill.\n\nOne guy literally ghosted us. He said he was heading to the washroom and just disappeared, leaving the bill behind (honestly, that's on me for not seeing that coming). \n\nOn top of that, another guy was making things awkward by trying to sit way too close to one of my female friends, despite her clearly expressing she was uncomfortable. We had to step in and ask him to leave the group. Thankfully, the rest of the evening went smoothly. \n\nAfter the whole ordeal, we came up with a set of ground rules that could be helpful for you too—feel free to add anything that might make the experience safer and more enjoyable for everyone.\n\n1. Setting a minimum Karma limit to make sure no spam account or a banned account for whatever reasons is joining. \n\n2. No tagging along with friends apart from the people in the group. No +1s or anything of that sort.\n\n3. No alcohol or expensive cafes should be included in the trip due to the frequency of scams that happen around the city, occasional smoking stops can be made. \n\n4. Minimum age is 18+ as the rest of you might get in trouble if the parents yell for going out with strangers,\n\n5. Only travel in daylight and return before night and only in public places for the safety of everyone.\n\n6. for any payments above 150/- per person everyone will have to pay the vendor individually to decrease the potential of getting scammed.\n\n7. Encourage participants to use their Reddit usernames rather than their real names if they feel more comfortable. It's also wise to allow people to opt-out of group photos to maintain privacy.\n\n8. After the meetup everyone can give rating to everyone anonymously through forum to organise future meetups according to group dynamics.\n\nFeel free to add any more points you think will be helpful or something I missed.\n\nHope this helps, Peace out ☮️\n\n",
    "url": "https://reddit.com/r/bangalore/comments/1h1exd2/for_everyone_who_are_organizing_or_visiting/",
    "subreddit": "bangalore"
  },
  {
    "title": "I want to teach coding",
    "text": "So it's been like 2 months of me moving to Bangalore. I'm 23, software engineer at a startup and I kinda enjoy teaching stuffs. I have free time on Saturdays and Sundays and spend most of my time in my room so I was wondering if anyone wanted to learn coding on weekends. I can use up my free time to teach you all, which I enjoy. I  don't need any money on this. Would just love to hang out and teach someone.\n\nWe can meet some place like a cafe or something, just bring your laptop if you have one. \n\nLet me know if anyone's interested",
    "url": "https://reddit.com/r/bangalore/comments/1dix4gc/i_want_to_teach_coding/",
    "subreddit": "bangalore"
  },
  {
    "title": "Dog/Cat Cafes in Bangalore",
    "text": "Are there any legit cat/dog cafes in Bangalore? I want to take my nephew and niece to play with the intention of giving them legit interaction with animals unlike at a zoo. What are my options? A quick google maps search showed only one near the airport which doesn't look like a legitimate establishment.\n\nUpdate: Thanks everyone for the recommendations. I found a dog cafe anda cat cafe. And seems Cubbon park before 10 by the dog park is a great place too.",
    "url": "https://reddit.com/r/bangalore/comments/rpdvfq/dogcat_cafes_in_bangalore/",
    "subreddit": "bangalore"
  },
  {
    "title": "Lack of ambition to be rich and earn more?",
    "text": "Hello everyone I am 23 M currently working as a software engineer in Bangalore in one of the MNCs and I graduated from a tier 1 institution this year only. \n\nI come from a middle class family from a small city in Rajasthan. My parents are not dependent on me as they are earning and I don't have any loans too. \n\nNow it has been 3 months in the city and I am comfortably living here and my expenses are barely 30-35k including everything. Now whenever I meet my friends or seniors they are extremely passionate about being rich by earning 30/40/50/60 lpa after some X years and they dream of earning 1 crore + in next 10-12 years. \n\nNow I don't dream of such targets because I don't know what I will do with so much money as I have a middle class lifestyle and have no desire to change myself to fake lifestyle of being rich. Currently I save around 70k each month and invest everything in mf, index funds and some part in fd. \n\nI don't have any plans to buy a home in Bangalore as I don't want to bind myself to work only in a particular city for whole life. Plus I don't plan to buy a car too here as I have comfortable bus route to my office and don't won't to contribute to traffic. \n\nPlus I don't go to cafe's with my friends generally because I don't like the junk food they serve there and the food is too expensive. I don't buy new expensive clothes as I already have a decent collection bought over last 4 yrs in college. I don't go to clubs and pubs as I hate party culture and I don't drink alcohol. Generally I prefer eating normal indian food which I cook daily with help of YouTube and asking my mother. \n\nNow I wanted to ask is it all right to not have any dreams to be rich or lead luxurious lifestyle and save most part of your salary. Any tips which you want to go give to me to proceed with my career. \n\nEdit - I am not saying that in future I don't want to switch or get promoted but just that I don't want to run madly after switching for higher pay regardless of the work life balance and all. Switching, career growth and promotions which I view positively for career growth too. \n\nTLDR - 23 Yo Middle class boy from Small city in Rajasthan started earning 15 lpa in Bangalore but saves most of it and have no desperations to earn more or be rich quickly. Is it allright and what approach to follow next?",
    "url": "https://reddit.com/r/india/comments/16wglhd/lack_of_ambition_to_be_rich_and_earn_more/",
    "subreddit": "india"
  },
  {
    "title": "Travelled across 7 states using public transport. Sharing my experience.",
    "text": "\nHey guys. Want to share and discuss my trip with you all. It was a completely on-the-go trip using public transport. I knew where I was starting from and I knew where I had to finally reach, everything else was pretty much decided on the way. I used every sort of public transport within this trip— from premium sleeper buses to government roadways buses, metro to auto rickshaws and of course, trains. I even rented bikes during my stay in some of the cities. I met so many strangers and while I would not call it “life-altering” but it definitely calibrated me as a person. As time goes by, I realise it had a deeper impact on me than I had realised back then. \n\n\n\nSo, here it goes: \n\n\n\nRoute : Bangalore -> South Goa -> Panaji -> North Goa -> Pune -> Ahmedabad -> Udaipur -> Pushkar -> Jaipur -> Agra -> Hometown -> Delhi\n\n\n\nI started from Bangalore and took a bus for Palolem beach from Anand Rao circle in Bangalore. It was a sleeper bus (Smart Intrcity, Mercedes Benz model). It was a premium bus, highly recommended. When I woke up the next morning, we were stuck in a long traffic jam in the ghat section between Yellapur & Karwar. We reached Palolem pretty late in the afternoon. Took an auto to my hotel which was located just 20 meters from the beach — The Pearl Beach resort. It had comfy little wooden huts with sliding doors with glass panels (and curtains obviously) - it was really nice. I took a bath and went to the beach straight away. It was already evening and I only few hours of light was remaining. I walked along the beach. It was low tide and I walked a long way to the place where the cliffs meet the ground. I only realised that it was a low tide while walking back and the sea had already claimed the land through which I had walked just few minutes before. By the time I reached back the starting point, it was completely dark and the section between the cliffs was pretty much entirely cut off from the beach. I stayed at Palolem for another day and then reached Panaji. I took a government roadways bus from the bus station to Madagaon. On the Madgaon bus station, I was lucky to spot the fast AC shuttle that ply between Madgaon and Panjim and boarded it. Reached Panaji, rented a scooter right on the bus stand itself, loaded my stuff and reached my hotel which was on the other side of the river — Rio Boutique near Ries Mogos (which I visited early next morning). Drove on scooter from this hotel and reached North Goa where I stayed for another 2 days. At the end of second day, came back to Panji, returned the scooter, and took another bus to Pune. This was my first trip to Goa.\n\nPune was a pitstop — as in I stayed from 8 AM till 5 PM only. I got off the bus and…. Walked. I had my rucksack on my back, and my camera bag — that’s all.  I had visited Pune earlier so I knew what to expect. I like Pune. You can still see people sitting together having breakfast. One still feels connected to other people there. Anyways, I had to go to a certain cafe where I had met someone long ago. I took a cab as it was quite far and had walked long enough. I was one of the first customers of the cafe. It is near the Aga Khan Palace. I used their washroom to freshen up and had breakfast. After few hours and setting up my camera gear, I left. I took metro and reached Pune station. My train’s arrival was still few hours away.  I had booked the tickets from Pune to Ahmedabad in the bus on my way to Pune. Anyways, I put my rucksack in the station cloak room and walked out of the premises to check out the neighbourhood. I walked and walked and reached a mansion that is supposed to be haunted. Not that I believe in that kind of stuff, but it was a little creepy even during the day. Pune people might know which place I am talking about. Walked back and had some snacks - really liked Paani Puri near the station. I posted a letter from the RMS unit of Post Office and talked to some friends over the call while walking around the station premises. The sound of the rotating ghungroos (anklet bells) on the sugarcane juice centers still lives in my brain. After killing some time in the railway waiting room and walking on the platform, I finally boarded the train. And you know, a lot of the times, this is what journeys are like - you are bored, you are alone and nothing special happens and that’s fine. You have to be cool with that. How else would you differentiate the special stuff ?\n\nAnyway, I reached Ahmedabad next morning. I took a cab to reach Sabarmati Ashram. There were a lot of architecture students, sitting all over the place and drawing the museum building (it is supposed to be build like an ideal village home, iirc). I visited the home where Gandhiji used to live. With this charkha still there in the outer room where he used to receive guests. While he had his faults (and will probably seem to have more as time passes and our moral constructs evolve) — I have always admired him and respected him. People still take their shoes off when entering the premise. There is a small bookstore in the premise where I found one gem of a book — it’s called A walking tour: Ahmedabad by Oostrum & Bracken. It describes the architectural uniqueness of Ahmedabad in a fascinating way and allows you to explore it yourself through a series of heritage walks. While I could have certainly have used the book itself to do at least one of the most popular walks in the old Ahmedabad, I had already booked a heritage walk with a agency (it costs a measly 400, including breakfast). In the evening, I walked from my hotel to the Riverfront, which was farther than expected. Saw the Atal Bridge built over Sabarmati. It has nice lighting cast over it during the evening with mostly families visiting it. I walked back to my hotel after sunset and tried a few curious looking street food items. Next morning, I had the Heritage walk — that started from the SwamiNarayan temple and ended at the Jama Masjid. I would say this was my highlight of the city and to an extent the whole trip. There was so much to learn and it was really really interesting. Our guide was also great. I was the only one who booked the heritage walk with breakfast and he took me to one of the legacy sweet/breakfast shop and I forced him to break bread with me :) \n\nIn the afternoon, I had to catch another train to Udaipur. I caught that from the station that is little farther from the city centre. It was afternoon and it would take me roughly 6 hours to reach Udaipur. I utilised this time to look up a few hotels in Udaipur and instead of booking online, I called them and paid directly to them and got a better deal. Come Udaipur, I reached my hotel, went to the terrace for dinner and was greeted with the glamorous view of the Lake Pichola. Costly dinner though. Next day — visited the city palace which was literally back door, took my sweet time and clicked so many pictures. It’s very beautiful but entry fee is very costly too. Ever since visiting it, I have noticed it multiple advertisements which are shot in that palace. I walked around the Lake pichola in the evening. I walked through the lanes, crossed the bridge and ended up at the Ambrai Ghat (it also shows up in some movies). I still remember noticing the Venus shining over the lake. I was approached by a girl who wanted me to click her pic, turns out it was her last day in Udaipur as she was finishing her internships in one the nearby five star hotel. She had finally gotten the chance to sightsee the very city she was working in for months. \n\nNext morning, I rented a scooter and drove around Fateh Sagar lake in the early morning - great experience btw. During the evenings, it must be pretty crowded but during the morning, it was almost empty. I went further and reached the Sajjanpur palace which is 30kms outside of the city. On my way, I had Poha for breakfast and posted another letter from Rani Road Post Office ( btw, I was witness to a small escalation with threats levelling from both sides lol). In the palace, I clicked some pics, there wasn’t much to do and it was getting warmer so I went back to my hotel where I passed some time. By the evening of this day, I was already feeling little down  and nostalgic for something missing (it’s a weird feeling). I felt like the romantic setting of the place (and specially Lake Pichola), did not jive well with a young solo traveller. \n\nVery early morning, the next day, I left for the station. Before I could get an auto — I was already chased by some street dogs, hid in a public washroom and henceforth saved by a cleaning worker (who might as well be an angel to me ). Got my train and reached Ajmer in the peak afternoon. Took a bus to Pushkar and crossed the Regional College of Education, where my father was a student a long time ago. Reached Pushkar, found a good value for money home stay and cleaned up. In the evening, I took a walk to the nearby ghat (one among many across the lake) — and witnessed the evening prayers conducted everyday. Lot of Isreali folks and touts making a fool out of them. Next morning I visited the famous Brahma temple and then it was time to leave. \n\nAt this point, I want to note two things: \n\n1. Pushkar was extremely disappointing to me. Mainly because of the picture of Pushkar painted by my father when he used to visit it in the mid 70s — with its rose fields and peace and tranquility and 0 tourists — the current Pushkar was anything but that. Great laffa rolls though (you have to look at the positive side of things).\n\n2. I was sick of staying in the hotels at this point. I could not, would not, pack and unpack a single more time in an hotel. I was done. I was ready to go home.  \n \n I shared an auto to Ajmer with a lady and her brother ( he was mute) — and what a lady she was! She was extremely qualified with multiple PhDs and was a professor at a university. I could probably write a post as long as this, just in our conversation during those 30 minutes. I even took her contact as I bid her farewell. \n\nIt was a Vande Bharat that took me from Ajmer to Jaipur. I had originally planned to stay in Jaipur but as I said earlier, I was ready to go home. So, I cancelled the train ticket I had booked from Jaipur to Agra, the next day. I decided to reach home the same day without any stop in between. As I walked out of the railway station, I met I met an older couple who I had met two days ago in Udaipur at a cultural dance event. They were surprised to see me and the auntie joked on seeing me approach them “Arrey tum fir se mil gaye!” (Oh, you met us again!). The uncle was a retired army officer and participated in the India Bangladesh war. Surprisingly, they had even lived in my hometown for some time and we had a fun discussion about that in Udaipur. I took the Metro to the nearby bus stand (It was just one station away) & looked around for options to reach Agra. I found that the only sleeper bus was completely booked. There were no volvo bus options. My only option was a UP roadways bus. It was an old, noisy, typical public govt bus & I stood out like a sore thumb. It took me six hours sitting in the bus to reach Agra at night around 9 o’clock. I reached from one bus stand to another and boarded a bus to my hometown, which took another two hours. \n\nAt 11 in the night, finally, I reached my home, and I told my father that I’m coming from Agra. Since he was not aware of my plans, he was surprised that I reached home one day earlier than expected. He asked me how did I reach Agra. I told him I reached Agra from Ajmer. He enquired, did I take a flight from Bangalore to Ajmer? I said no, I reached Ajmer from Pushkar. The next question was obviously how did I reach Pushkar? I said from Udaipur.  “And Udaipur?” he asked. I said “Ahmedabad”. At this point, he started laughing. He said it means “you have been doing whole Bharat bhraman”.\n\nI stayed a few days at my home and then left for Delhi where I met my friends and flew back to Bangalore. \n\n\n\nI had always dreamed of doing this trip with my bike but I realised I was not prepared for it. And the risk was too high. I did not tell my family about it but I had a network of friends who were in touch with me throughout and would inform my family in case something untoward happened. There is a lot I’m not writing here, believe me it’s the least I could have written about it. This was something I had wanted to do for a long time. In many ways, I very much needed to do it when I finally did it. It might sound like an hyperbole, but for some personal reasons, it was something that I absolutely saved me. I’m very very thankful and realise how big of a privilege it is do something like this. \n\n\n\nYou can find some of the pics I clicked through my journey here: https://flic.kr/s/aHBqjBT25t\n\n\n\nLet me know if you have some questions for me. Apologies for the poor write up, I realise it could have been better !\n\n\n\nCheers !\n\n",
    "url": "https://reddit.com/r/india/comments/1kkte9n/travelled_across_7_states_using_public_transport/",
    "subreddit": "india"
  },
  {
    "title": "Suggestion for a place to live in India",
    "text": "I have lived overseas since 17 (Currently 31 years old) and looking to move back to India but in a dilemma around the city to choose.\n\n**Priorities, not requirements:**\n\n* Modern city so infrastructure like decent internet, road infrastructure and medical facilities aren’t terrible.\n* A city that provides a sense of safety - Yes, crime is everywhere but not something that’s considered normal due to safety of the place.\n* Not too expensive so somewhere where a person can live comfortably for Rs. 50k-100k per month - I think this take Pune and Bangalore out of the question.\n* Ideally a place where people speak Hindi or English. While South India seems absolutely fabulous, it’s not ideal if you can’t become friends with locals due to language barrier.\n* Ideally the maximum temperature is 31 degrees and mostly the temperature is between 18–26 degrees - I can't stand hot weather so that's one thing I can't compromise on\n* As I will be starting a new life so a place where it’s easier to meet people and make friends - I understand it’s a time-consuming part but don’t want to end up in a place where people just mind to themselves\n* Ideally a city with an airport\n* A place that’s not super crowded where traffic jams and not being able to walk without running into each other, are considered normal.\n* Lastly, ideally a place where I can open a cafe (Undecided yet but I am confident that I wouldn’t like to get a job in India) so would get involved in some freelancing or a small business.\n* The only place that comes to mind (based on my limited knowledge and experience) is Dehradun, but I don’t want to assume as I don’t know, what I don’t know, hence asking.\n* I am a Vegan so ideally a place where they have people with modern thoughts and are open-minded. \n\nYour suggestions/recommendations would be much appreciated.",
    "url": "https://reddit.com/r/india/comments/156kpcw/suggestion_for_a_place_to_live_in_india/",
    "subreddit": "india"
  },
  {
    "title": "Have been invited to Indian wedding, please help with Pune - ? - Mumbai/Bangalore trip",
    "text": "Hello,\r\nwe've been invited to Indian wedding which takes part in Pune, the wedding takes two days, but after that we would like to explore a bit of India. Unfortunately, after the we wedding we only have 6/7 full days as we need to back to Europe. :) On the first day, in the morning we would like to fly somewhere from Pune and then move slowly using land transport towards Mumbai (or maybe Bangalore), where it's affordable for us to fly from.\r\n\r\nThe host suggested these possibilities to us with the commentary:\r\n- Goa - Nice beaches, good vibes, hippie parties (best places - Mandrem, Ashvem)\r\n- Udaipur or Varanasi - Very old cities, if you’ll want a taste of the culture. More raw experience\r\n- Dharamshala - You can go to a small town above called Dharamkot - lot of cafes, nice hikes and buddhist monasteries.\r\n- Kerala (Thiruvananthapuram) - amazing nature, lush forest, beaches, tiger reserves.\r\n\r\nHowever, the only feasable one seems to be Goa, (as there is a night train to Mumbai), but we are not that interested in beaches etc. Varanasi, Dharamshala and Kerala are too far from by the land to our final destination. \r\nThe plan we came up with is to fly to Delhi, and then move to Agra, Jaipur, the mentioned Udaipur and then finally to Mumbai. I don't know if it's too ambitious, if it is please correct me. We would like the cities and some nature on the way.\r\n\r\nDoes it make sense? Is there any other plan we should consider?\r\nThanks!",
    "url": "https://reddit.com/r/india/comments/16sfkpy/have_been_invited_to_indian_wedding_please_help/",
    "subreddit": "india"
  },
  {
    "title": "Feeling alone!! Hard to find company of people to explore Bangalore",
    "text": "As a 24-year-old Indian citizen who has been living and working in London for some time, I recently moved to Bangalore and have been feeling a strong desire to explore the city's cafes, clubs, parks, lakes, hiking trails, and sports activities. Unfortunately, I have lost touch with my school friends in India and I feel weird to go out and explore on my own (can't eat alone in cafe :-( ). While I do have some work colleagues in the city, they are boring af, and other don't have time on week days and on weekend they usually makes plan with their best friends. So overall I'm always left alone.\n\n&#x200B;\n\nI am looking for suggestions on how to meet new people who are also interested in exploring the city and potentially become friends with them.\n\nJust wanted to know that am I the only one who is facing this problem or are there other too?",
    "url": "https://reddit.com/r/india/comments/124om8f/feeling_alone_hard_to_find_company_of_people_to/",
    "subreddit": "india"
  },
  {
    "title": "Market for Boba tea/ cafes/ gourmet sandwiches in India post pandemic?",
    "text": "Pretty much the title. I have been obsessed with these cute cafes I've been seeing all over Korea and it's truly my heart's desire to start my own thing someday.\nThey do sandwiches and drinks and soda based drinks or bubble tea. \nIs there a market for this in India, specifically in Bangalore, Kolkata or Hyderabad? \nI've seen so many food ventures fail, I want to know if there's a point in pursuing this in India.",
    "url": "https://reddit.com/r/india/comments/p2jukt/market_for_boba_tea_cafes_gourmet_sandwiches_in/",
    "subreddit": "india"
  },
  {
    "title": "Where to live in Bangalore?",
    "text": "I am a 27 year old man from northern Europe moving to Bangalore for the winter because of the weather. Would appreciate tips/advice on which region of the city is best for foreigners, so that shops/clubs/cafes are in the walking distance. Is it better to rent a house or an apartment? \n\nPerhaps you could even recommend me some landlords....",
    "url": "https://reddit.com/r/india/comments/ymbdey/where_to_live_in_bangalore/",
    "subreddit": "india"
  },
  {
    "title": "Potential scam? What do you guys think?",
    "text": "so I have heard a lot about the scams that are happening in Delhi on dating applications. I got matched with this girl and I offer her a Drive, but she particularly wants to meet at a single place and wants to go for cafe. well, I have asked her and gave her better choices than that place. Not sure why she wants to go there itself.\n\nAlthough I have recently moved from Bangalore, and I loved it here. I just don’t want to get caught up in these things. \n\nSo tell me what do you guys think?",
    "url": "https://reddit.com/r/delhi/comments/1l2z73z/potential_scam_what_do_you_guys_think/",
    "subreddit": "delhi"
  },
  {
    "title": "Met nice couple at Vidyarthi bhavan",
    "text": "This happened today morning, and I’m still feeling really touched by the whole experience. I met a retired army couple at Vidyarthi Bhavan, and we ended up having such a warm and genuine conversation. They’ve been in Bangalore for about 18 months and were visiting Vidyarthi Bhavan for the first time—just like me. My friends, however, have been coming here for years.\n\nWe talked about so many things—the uncle’s army days (his last posting was in Meghalaya), their retirement life, and even compared dosas at Vidyarthi Bhavan and Rameshwara Cafe. They were so kind and humble that they even paid our bill, even though we insisted on paying for ourselves. It was a simple gesture that really meant a lot.\n\nThey are from Delhi. The uncle’s name is Manish and the aunty’s name is Neetu. They have two sons named Samratha and Angadh. If Samratha and Angadh see this post, I want to sincerely thank you both for the wonderful time and kindness your parents showed us. It was a small meeting, but it left a big impression on me. Wish i had taken atleast one pic... \n\n",
    "url": "https://reddit.com/r/delhi/comments/1l6aejp/met_nice_couple_at_vidyarthi_bhavan/",
    "subreddit": "delhi"
  },
  {
    "title": "which one would you recommend: pa pa ya or ping's cafe orient?",
    "text": "my brother's coming to town for the first time. he loves asian food and said that these chains aren't present in bangalore where he lives. where should i take him?",
    "url": "https://reddit.com/r/delhi/comments/1krw426/which_one_would_you_recommend_pa_pa_ya_or_pings/",
    "subreddit": "delhi"
  },
  {
    "title": "Which is the  best PC gaming zone in Delhi or around (gurugaon,NCR)",
    "text": "Looking for a place to try out PC gaming with high specs for FPS shooters like valorant, I could find a lot of good places in Mumbai and Bangalore, but in Delhi gaming cafes have mid built PC’s. ",
    "url": "https://reddit.com/r/delhi/comments/1knwtdq/which_is_the_best_pc_gaming_zone_in_delhi_or/",
    "subreddit": "delhi"
  },
  {
    "title": "Delhi doesn't deserve good music. ",
    "text": "Been in the music/live event industry for more than 10 years, What I have experienced is delhi people(masses) like only party music. They dont like to check out new bands with original music even the popular ones. If you check book my show site in mumbai, Bangalore or pune, you will see so many events happening every weekend with new bands performing. In delhi we listen to same bollywood/punjabi playlist in every club and cafes every weekend. Thats the reason we dont have good concerts and music festivals in delhi unlike other metro cities and this is just sad. ",
    "url": "https://reddit.com/r/delhi/comments/1gu2hpu/delhi_doesnt_deserve_good_music/",
    "subreddit": "delhi"
  },
  {
    "title": "Shopping areas near Delhi airport",
    "text": "Hi folks,\nI’m looking for areas in Delhi that are similar to Indira Nagar in Bangalore — vibrant, with good shopping options (clothes, accessories, etc.), cafes, and an overall fun vibe. Ideally, it should be reasonably close to the airport.\n\n\nThanks in advance.\n\n\n\n",
    "url": "https://reddit.com/r/delhi/comments/1gt68jn/shopping_areas_near_delhi_airport/",
    "subreddit": "delhi"
  },
  {
    "title": "Bringing Authentic South Indian Flavors to Delhi: Let's Collaborate?",
    "text": "If you've been to Bangalore and know places like Rameshwaram Cafe or Dakshini, do you think something similar could work in Delhi? I've been here for a year and feel there’s a real need for an authentic South Indian food joint, especially one that serves tiffins and snacks. I'm open to hearing your food business ideas and would be up for collaborating if our visions align. Let's discuss!",
    "url": "https://reddit.com/r/delhi/comments/1gti3hn/bringing_authentic_south_indian_flavors_to_delhi/",
    "subreddit": "delhi"
  },
  {
    "title": "Best place(s) to have South-Indian Food?",
    "text": "I was wondering if there are any quick breakfast or snacking places/spots in Delhi to have South Indian food. I recently stayed in Bangalore and the culture there is very different to Delhi - they have a very cafe vibe to such eateries while Delhi has a Dine-In culture to South Indian food. Any recommendations?\n\nAlso, what do you prefer to eat when you are at your favourite spot? I want to have a good breakfast at reasonable rates. So budget suggestions are welcome 😀👍",
    "url": "https://reddit.com/r/delhi/comments/14jg1k3/best_places_to_have_southindian_food/",
    "subreddit": "delhi"
  },
  {
    "title": "Asked ChatGPT to honestly and funnily describe the top 20 neighbourhoods of Delhi",
    "text": "Inspired from a similar post on r/bangalore today. See the post [here](https://old.reddit.com/r/bangalore/comments/14ssp1z/i_asked_chatgpt_to_honestly_and_funnily_describe/) if interested.\n\n&#x200B;\n\nDo you folks agree with ChatGPT's assessment? :P\n\n&#x200B;\n\n1. Karol Bagh - The chaotic circus of Delhi, where traffic and street vendors engage in a perpetual dance. You'll find more shops selling wedding attire than there are actual weddings happening.\n2. Hauz Khas - A trendy hangout spot for the city's hipsters. Get ready to navigate through a labyrinth of narrow lanes to reach the trendiest cafes and bars where people discuss philosophy while sipping their artisanal chai lattes.\n3. Chandni Chowk - The ultimate treasure trove for shopaholics and foodies. Be prepared to get lost in a maze of narrow lanes, crowded with shops selling everything from cheap trinkets to extravagant bridal wear. And don't forget to sample the mouthwatering street food, just be cautious of the fiery spices!\n4. Connaught Place - Delhi's bustling commercial hub and a paradise for shopaholics. It's a circular market with shops, restaurants, and cafes at every nook and cranny. It's the perfect place to indulge in some retail therapy and then cool down with a refreshing ice cream sundae.\n5. Safdarjung - A posh neighborhood where everyone seems to own a BMW or a Mercedes. It's the address for the city's elite, where they reside in luxurious bungalows and discuss the stock market over evening tea.\n6. Dilli Haat - An open-air market that showcases the diverse handicrafts and cuisines from across India. It's like stepping into a cultural carnival where you can haggle for handcrafted souvenirs while devouring regional delicacies from every corner of the country.\n7. Mehrauli - A neighborhood steeped in history and dotted with ancient monuments. Explore the grandeur of Qutub Minar and then enjoy a picnic in the sprawling gardens, but beware of the mischievous monkeys trying to steal your snacks!\n8. Greater Kailash - Delhi's answer to Beverly Hills. Immaculately groomed gardens, high-end boutiques, and luxurious homes define this upscale neighborhood. It's the perfect place to spot celebrities and pretend you're part of the elite.\n9. Paharganj - A backpacker's paradise and a melting pot of cultures. This chaotic neighborhood near the train station offers affordable accommodations, budget-friendly shopping, and a vibrant street scene that never sleeps. Just be prepared for the sensory overload!\n10. Lodhi Colony - An artsy neighborhood that will transport you to a world of vibrant street art. Every wall is a canvas, and you'll find yourself surrounded by colorful murals and graffiti that tell stories of love, politics, and social issues.\n11. Saket - A modern and sleek neighborhood where you can find the best malls and multiplexes in the city. It's the go-to place for shopaholics and movie buffs who want to catch the latest blockbuster while sipping on gourmet coffee.\n12. South Extension - A shopaholic's dream come true. Whether you're looking for high-end fashion brands or affordable streetwear, this neighborhood has it all. Just make sure to bring your credit card and a sturdy shopping bag!\n13. Malviya Nagar - A vibrant and quirky neighborhood known for its bustling street markets and affordable eateries. From stylish clothes to funky accessories, you can find it all here without burning a hole in your pocket.\n14. Rajouri Garden - The foodie's paradise. This neighborhood is packed with restaurants and cafes offering a plethora of cuisines from across the world. Indulge in a gastronomic adventure and leave with a happy and satisfied belly.\n15. Janakpuri - A residential area known for its large and well-planned housing societies. If you want a glimpse into the daily lives of the middle class in Delhi, take a stroll through the tree-lined streets and observe families going about their routines.\n16. Rohini - A suburban neighborhood that feels like a world of its own. With its wide roads, clean parks, and residential complexes, it's a peaceful retreat from the chaotic city center. Perfect for a leisurely walk or a picnic with friends.\n17. Lajpat Nagar - A bustling market where you can find everything from trendy clothes to traditional handicrafts. It's also a hub for street food, so bring your appetite and prepare to feast on delicious chaat and golgappas.\n18. Dwarka - A planned sub-city that feels like a separate town altogether. With its modern infrastructure, wide roads, and spacious apartments, it's a breath of fresh air in the bustling city. Don't be surprised if you find yourself getting lost in its organized labyrinth of sectors!\n19. Noida - Technically not a neighborhood of Delhi, but close enough to be included. It's a city of its own, known for its sleek high-rise buildings, massive shopping malls, and a thriving IT industry. Think of it as Delhi's younger, more tech-savvy cousin.\n20. Gurgaon - Another satellite city adjacent to Delhi, renowned for its towering skyscrapers, corporate offices, and extravagant shopping malls. It's the epitome of the modern urban jungle, where people work hard and play even harder. Traffic can be a nightmare, but the city's nightlife more than makes up for it.",
    "url": "https://reddit.com/r/delhi/comments/14sxqvf/asked_chatgpt_to_honestly_and_funnily_describe/",
    "subreddit": "delhi"
  },
  {
    "title": "Bangalore style dosa in delhi? ",
    "text": "i’m a sucker for the Bangalore style dosas - very crispy on the outside but thick so that it’s soft and fluffy \n\nif you know Bangalore and have been to Taaza Thindi you know what i’m talking about \n\nWill Karnataka bhawan have dosas like that? There’s also a Karnataka Food Center in RK Puram which has good reviews on Zomato \n\npls help me find my dosa thanks ❤️\n\nPS - I wasn’t the biggest fan of Carnatic Cafe ",
    "url": "https://reddit.com/r/delhi/comments/1d0ygxy/bangalore_style_dosa_in_delhi/",
    "subreddit": "delhi"
  },
  {
    "title": "9-Day Vietnam Trip Itinerary (North to Central) – June 2025",
    "text": "I recently completed a 9-day Vietnam trip covering Sapa, Hanoi, Ninh Binh, Da Nang, and Hoi An, with my partner. Sharing our detailed day-wise itinerary and travel logistics to help others who may be planning a similar route. We prioritized scenic locations, efficient travel, and local cuisines and experiences across both North and Central Vietnam.\n• Trip period: June 1st week\n• Total budget: 1.35 lakhs (including flights, excluding shopping)\n\n\nDay 0 – Flight from Bangalore to Hanoi\n\nWe boarded an evening flight from Bangalore to Hanoi. Since our plan was to head straight to Sapa the next morning, we didn’t book a hotel in Hanoi for that night. Landed in Hanoi at 2 am, the immigration queue took about 1 hour and we waited at the airport.\n\n\nDay 1 – Hanoi to Sapa\n\nAfter landing in Hanoi early in the morning, at 7 am we took a sleeper bus(Sao Viet) to Sapa (around 6 hours). We reached Sapa by early afternoon, checked into our hotel, had pho for lunch, and spent the rest of the day exploring the town. Hotel was booked close to Sapa Station. We visited Sun Plaza, Cat Cat Village, and enjoyed the cool mountain weather. The evening was relaxed—we explored the local market and tried street food and Vietnamese milk coffee\n\n\nDay 2 – Fansipan and Return to Hanoi\n\nWe checked out early and left our luggage at the hotel. Headed to Fansipan, the highest peak in Indochina. The cable car ride and views were stunning, though it was quite windy and cloudy at the top. Pre-booked the tickets via klook. After coming back to Sapa town in the evening, we had dinner and boarded a sleeper bus back to Hanoi.\n\n\nDay 3 – Ha Long Bay Day Cruise\n\nWe reached Hanoi early morning at 5 am, kept our bags at the hotel, and rested for a few hours. We were then picked up for a full-day Ha Long Bay cruise, pre-booked via klook. It included bamboo boat ride, a seafood lunch on board, and visiting Ti Top Island. We returned to Hanoi by evening and walked around the Old Quarter, grabbed dinner and coffee, got our USD exchanged to VND and finally checked-into hotel.\n\n\nDay 4 – Ninh Binh Day Trip\n\nWe did a full-day tour to Ninh Binh that covered the Mua Caves hike, Trang An boat ride Bai Dinh Pagoda, and a visit to the ancient capital, Hoa Lu. Booked the trip via Klook, the bus picked us up at 7 am from the hotel. It was one of our favorite days—peaceful, green, and different from the big city buzz. We returned to Hanoi around 7 PM and spent the evening shopping at the night market and around Hoan Kiem lake.\n\n\nDay 5 – Hanoi to Da Nang\n\nWe checked out in the morning, left our luggage at the hotel, and spent a few relaxed hours exploring the Old Quarter. We tried banh mi, egg coffee, and shopped for souvenirs at Dong Xuan Market. In the evening, we flew from Hanoi to Da Nang and checked into a hotel there at midnight.\n\n\nDay 6 – Ba Na Hills and Golden Bridge\n\nWe spent the whole day at Ba Na Hills. Booked the trip on klook, with shuttle bus pickup and drop. The Golden Bridge was impressive and the entire resort felt like a theme park. We returned to Da Nang by evening and explored the riverside area. We also visited a Michelin star restaurant nearby to try Banh Xeo for dinner.\n\n\nDay 7 – Hoi An\n\nAfter checking out from our Da Nang hotel, we visited Han Market to explore souvenirs, had Mi Quang noodles for lunch and took a Grab to Hoi An (around 45 minutes). We spent the day exploring the Ancient Town—very charming with lantern-lit streets and historical buildings. In the evening, we did a lantern boat ride on the river and tried some local dishes like cao lau and white rose dumplings.\n\n\nDay 8 – Return to Da Nang\n\nWe returned to Da Nang in the morning and checked into a hotel near the beach. We spent the afternoon visiting Marble Mountains and a quick swim at My Khe Beach. In the evening, we attended the Da Nang Fireworks Festival which was a fantastic experience. The entire riverside came alive with lights and energy. \n\n\nDay 9 – Flight Back to Bangalore\n\nWe checked out in the morning and headed to the airport for our noon flight back to Bangalore. It was the end of a truly memorable trip.\n\n\nFew tips and “wish-we-had” moments\n\n1. Don’t underestimate travel time in Sapa. Even though the limousine buses are comfy, the 6-hour journey each way eats up quite a bit of time. If we had one more day, we would’ve spent an extra night in Sapa to soak in the vibe without rushing.\n\n2. Vietnam runs on early starts! Most tours pick up by 7:30–8:00 AM. One day we were literally jumping into the tour van half asleep after an overnight bus. Not ideal. Give yourself breathing space if you’re doing back-to-back excursions.\n\n3. Pack for all weather types. Sapa was cool and misty, Hanoi was hot and humid, and Da Nang was blazing with sun. A light raincoat, sunblock, and breathable clothes saved us more than once.\n\n4. The Fireworks Festival is awesome, but get there early. We reached just in time and it was super crowded. For better views, go early or even consider watching from a riverside rooftop café if you can find one. We chose to go on Song Han bridge.\n\n5. Carry small change for street food and tips. Vendors and taxis often struggle to break big notes. We made it a habit to break VND 500k notes at supermarkets or cafés first thing in the morning.\n\n6. If you’re doing a packed itinerary with food adventures, it helps to carry basic medicines for motion sickness, upset stomach, cold/fever, etc. Sapa’s winding roads can make some people queasy.\n\n7. Buying a SIM at airport is a saviour if you are going directly to Sapa. Airport wifi is unreliable and you would need network to track the bus and pick up details/updates. Buy a SIM with just an overall data pack and not a per-day plan, as most cafes, restaurants and hotels would have wifi. No talktime is needed as you can communicate with grab via chat itself.\n\n8. Water cost is something that will pile up at the end. A 500ml bottle is 10.000 to 20.000 VND. In most of the places, you are expected to buy water.\n\n9. Try to look for hotels which include breakfast. Starting our days with a heavy breakfast and nimble on street foods throughout the day, helped us stay within budget.\n\n\nIf anyone is planning a similar route or has questions about logistics, buses, flights, or places to stay, feel free to ask. Happy to help!\n",
    "url": "https://reddit.com/r/travel/comments/1l8m3nb/9day_vietnam_trip_itinerary_north_to_central_june/",
    "subreddit": "travel"
  }
]